# Current Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModuleIterator..::..Current Property
MacroModuleIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Macro Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As Macro
	Get
```

Visual C++
---
```text
public:
virtual property Macro^ Current {
	Macro^ get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace